/*
Объявление функции случаи: 
1. слово function пробел <название функции> "(" опционально: параметры ")" "{" опицонально: инструкции "}"
2. <Объявление переменной через const or let> "=" слово function "(" опционально: параметры ")" "{" опицонально: инструкции "}"
3. <Объявление переменной через const or let> "=" "(" опционально: параметры ")" "=>" "{" опицонально: инструкции "}"


!!! Параметры, стрелочка, тело функции. Один в другом НЕ НАХОДЯТСЯ!!!


Вызов функции:
1. <Название переменной или метод переменной>"(" опционально: аргументы ")"

Передаваться по ссылке:
1. <Название переменной или метод переменной>
*/
const foo = () => {};
foo();
